[net]
batch=1
subdivisions=1
height=9
width=8
channels=2
momentum=0.9
decay=0.0005

burn_in=0
learning_rate=0.1
policy=constant
power=4
max_batches=1000000000000

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=lelu

[connected]
output=2
activation=lelu

[convolutional]
filters=2
size=1
stride=1
pad=1
activation=lelu

[cost]
type=sse
